[
  {
    "question": "During your internship at PwC, you enhanced the LightGBM algorithm. Imagine you discovered a significant bug in your implementation just hours before a crucial presentation. How would you approach this situation?",
    "basedOn": "PricewaterhouseCoopers (PwC) - Data Science Intern",
    "selectedAnswer": "Attempt to quickly fix the bug, even if it means a less polished solution, and present the results as planned, acknowledging the known issue."
  },
  {
    "question": "While working on Findr by OpuLnt, how did you balance the need for secure systems with the desire for a user-friendly experience for ASU students?",
    "basedOn": "Findr by OpuLnt - Full Stack Developer",
    "selectedAnswer": "Prioritized security above all else, implementing complex authentication measures even if they slightly hindered usability."
  },
  {
    "question": "As City Lead for ParmarthNGO during the COVID-19 crisis, you coordinated efforts with contractors for essential supplies.  If a contractor failed to deliver a critical shipment on time, what steps would you take?",
    "basedOn": "ParmarthNGO - City Lead",
    "selectedAnswer": "Accept the delay and reallocate existing resources to mitigate the impact, while waiting for the delayed shipment."
  },
  {
    "question": "In your role at WheelEasy Foundation, you improved the functionality of an interactive accessibility map.  If a user reported a critical accessibility issue not reflected on the map, how would you respond?",
    "basedOn": "WheelEasy Foundation - Frontend and Backend developer Intern",
    "selectedAnswer": "Acknowledge the feedback and explain that updates to the map are made periodically, assuring the user it will be addressed in the next cycle."
  },
  {
    "question": "Reflecting on your experience developing Resumagic, imagine a user reported that the generated portfolio website failed to render correctly on certain mobile devices. What would be your first step in troubleshooting this issue?",
    "basedOn": "Resumagic - AI-Powered Web Tool",
    "selectedAnswer": "Consult online forums and communities for similar reported issues and potential solutions related to mobile rendering."
  }
]